<!-- ======================================== Start make news ======================================== -->




<section class="news">

    @if (session('create'))
        <h3 style="width: 40%;margin: 10px auto;background-color: #38c172;color: #dfdfdf;text-align: center;padding: 10px;">{{ session('create') }}</h3>       {{-- تماس با ما  contact --}}
    @endif

    @forelse ($news as $item)

        <section class="itemNews">
            <div class="divNews">
                <h1>{{ $item->title }}</h1>
                <p>
                    <img src="{{ asset('assets/images/news/'.$item->image) }}" alt="{{ $item->alt }}">
                </p>
                <p  class="text">{{ \Illuminate\Support\Str::limit($item->summary , 300) }}</p>
                <a href="{{ route('showNews' , ['id' => $item->id]) }}">ادامه مطالب</a>
            </div>
        </section>

    @empty

            <section class="itemNews">
                <div class="divNews">
                    <h1>خبر شماره 1</h1>
                    <p>
                        <img src="{{ asset("assets/images/news/news_1635875256_202389_img-3.jpg") }}" alt="sampl" />
                    </p>
                    <p class="text">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
                        و متون بلکه
                        روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
                        متنوع با هدف
                        بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه
                        و متخصصان
                        را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
                        پیشرو در زبان
                    </p>
                    <a href="#">ادامه مطالب</a>
                </div>
            </section>


            <section class="itemNews">
                <div class="divNews">
                    <h1>خبر شماره 2</h1>
                    <p>
                        <img src="{{ asset("assets/images/wallpaper/computer-1.jpg") }}" alt="sampl" />
                    </p>
                    <p class="text">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
                        و متون بلکه
                        روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
                        متنوع با هدف
                        بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه
                        و متخصصان
                        را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
                        پیشرو در زبان
                    </p>
                    <a href="#">ادامه مطالب</a>
                </div>
            </section>


            <section class="itemNews">
                <div class="divNews">
                    <h1>خبر شماره 3h1>
                    <p>
                        <img src="{{ asset("assets/images/news/news_1635670672_564931_bg-2.jpg") }}" alt="sampl" />
                    </p>
                    <p class="text">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
                        و متون بلکه
                        روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
                        متنوع با هدف
                        بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه
                        و متخصصان
                        را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
                        پیشرو در زبان
                    </p>
                    <a href="#">ادامه مطالب</a>
                </div>
            </section>

    @endforelse

</section>
<!-- ======================================== End make news ======================================== -->
