<!-- ======================================== Start make news ======================================== -->




<section class="news">

    @if (session('create'))
        <h3 style="width: 40%;margin: 10px auto;background-color: #38c172;color: #dfdfdf;text-align: center;padding: 10px;">{{ session('create') }}</h3>       {{-- تماس با ما  contact --}}
    @endif

    @forelse ($news as $item)

        <section class="itemNews">
            <div class="divNews">
                <h1>{{ $item->title }}</h1>
                <p style="text-align: center;margin: 30px 0;border-bottom: 1px solid #444">
                    <img src="{{ asset('assets/images/news/'.$item->image) }}" width="400" height="300"
                         alt="{{ $item->alt }}">
                </p>
                <p>{{ \Illuminate\Support\Str::limit($item->summary , 350) }}</p>
                <a href="{{ route('showNews' , ['id' => $item->id]) }}">ادامه مطالب</a>
            </div>
        </section>

    @empty

        <section class="itemNews">
            <div class="divNews">
                <h1>خبر شماره 1</h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
                    و متون بلکه
                    روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
                    متنوع با هدف
                    بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه
                    و متخصصان
                    را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
                    پیشرو در زبان
                    فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت
                    تایپ به
                    پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود
                    طراحی اساسا مورد استفاده قرار گیرد.
                </p>
                <a href="#">ادامه مطالب</a>
            </div>
        </section>

        <section class="itemNews">
            <div class="divNews">
                <h1>خبر شماره 2</h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
                    و متون بلکه
                    روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
                    متنوع با هدف
                    بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه
                    و متخصصان
                    را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
                    پیشرو در زبان
                    فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت
                    تایپ به
                    پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود
                    طراحی اساسا مورد استفاده قرار گیرد.
                </p>
                <a href="#">ادامه مطالب</a>
            </div>
        </section>

        <section class="itemNews">
            <div class="divNews">
                <h1>خبر شماره 3</h1>
                <p>
                    لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها
                    و متون بلکه
                    روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
                    متنوع با هدف
                    بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه
                    و متخصصان
                    را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
                    پیشرو در زبان
                    فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت
                    تایپ به
                    پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود
                    طراحی اساسا مورد استفاده قرار گیرد.
                </p>
                <a href="#">ادامه مطالب</a>
            </div>
        </section>

    @endforelse

</section>
<!-- ======================================== End make news ======================================== -->
